Revit 2024 API
StructuralAsset.StructuralAssetClass Property
 The type of material that this structural asset describes (e.g. wood, concrete, metal.)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public StructuralAssetClass StructuralAssetClass { get; }
Visual Basic
Public ReadOnly Property StructuralAssetClass As StructuralAssetClass
	Get
Visual C++
public:
property StructuralAssetClass StructuralAssetClass {
	StructuralAssetClass get ();
}
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace